# 算术运算符 : + - * / // % **
print("10 + 4 =",10 + 4) # 加
print("10 - 4 =",10 - 4) # 减
print("10 * 4 =",10 * 4) # 乘
print("10 / 4 =",10 / 4) # 除
print("10 // 4 =",10 // 4) # 整除
print("10 % 4 =",10 % 4) # 取余/求模
print("10 ** 4 =",10 ** 4) # 幂指数,10的4次方

# 算术运算符的优先级 --> ** --> * / // % --> + -
print("0.1 + 10 / 4**2 = ",0.1 + 10 / 4 **2)

# 案例: 输入两个数 x 和 y ,计算x+y以及x-y的结果并输出
x = float(input("请输入第一个数 x :"))
y = float(input("请输入第二个数 y :"))

# 当输入x=0.5,y=0.4,算出 x-y =  0.09999999999999998-->精度损失
# 精度损失 :由于计算机底层是基于 二进制 进行数据的存储与处理,二进制是无法准确的表示所有的小数,因此涉及到浮点数的运算,可能会有损失精度
print("算出 x+y = ",x+y)
print("算出 x-y = ",x-y)

# # # # # # # # # #  赋值运算符 # # # # # # # # # #
num = 85

num += 10 # num = num + 10
print("num += 10 后,num = ",num) # 95

num -= 10 # num = num - 10
print("num -= 10 后,num = ",num) # 85

num *= 10 # num * num + 10
print("num *= 10 后,num = ",num) # 850

num /= 10 # num = num / 10
print("num /= 10 后,num = ",num) # 85.0

num //= 10 # num = num // 10
print("num //= 10 后,num = ",num) # 8.0

num %= 10 # num = num % 10
print("num %= 10 后,num = ",num) # 8.0

num **=3 # num = num ** 10
print("num **= 10 后,num = ",num) # 512.0

# # # # # # # # # #  比较运算符 # # # # # # # # # #
print("100==100 吗 : ",100==100) #True
print("'100'=='100' 吗 : ",'100'=='100') #True
print("100!=100 吗 : ",100 !=100) #False

print("100<100 吗 : ",100<100) #False
print("100<=100 吗 : ",100<=100) #True

print("100>100 吗 : ",100>100) #False
print("100>=100 吗 : ",100>=100) #True

# # # # # # # # # #  逻辑运算符 # # # # # # # # # #
# 案例1: 键盘输入一个整数,判断这个数字是否在 10-20 之间 -->在:True 不在:False
num = int(input("请输入你要判断的数 :"))
print(f"{num}在10-20之间:",10<=num and num<=20)# and连接的关系是并且的关系,两个条件同时成立(True),结果才是True;否则,就是False
print(f"{num}在10-20之间:", 10 <= num <= 20)

# 案例2: 键盘输入一个整数,判断这个数字是否不在 10-20 之间
num1 = int(input("请输入你要判断的数 :"))
print(f"{num1}不在10-20之间:",10>num1 or 20<num1)# or连接的条件,是或者的关系,只要其中有一个成立(True),结果就是True;全部不成立,结果才是False
