# if条件判断: 如果分数超过680,我就去清华读书
score = 600
if score>=680:
    print("欢迎你来到清华读书")
    print("也恭喜你即将踏入精彩的大学生活")#切记,这两行缩进要保持一致,python是通过缩进来判断代码的归属
print("----------------------------")


# if案例:结合前面学习的输入输出及if条件判断的知识,完成B站登录功能的实现(账号:18888888888,密码:000000)
ok_id = '18888888888'
ok_password = '000000'
# 1.接受用户输入的账号和密码
id = input("账号: ")
password = input("密码: ")

# 2.判断账号密码是否全部正确,如果都正确,则登录成功,进入B站首页
if id==ok_id and password==ok_password:
    print("登录成功~")
    print("进入B站首页~")

# 3.判断账号密码是否有错误的,如果有任何一个错误,则登录失败,提示错误信息
if id!=ok_id or password!=ok_password:
    print("登录失败!")
    print("账号或密码错误!")